# Tap head-only.
tap 'homebrew/head-only'

# Install brews.
brew 'clang-format'
brew 'colordiff'
brew 'dockutil'
brew 'homebrew/head-only/gitstats', args: ['HEAD']
brew 'ideviceinstaller'
brew 'imagemagick', args: ['with-webp']
brew 'lftp'
brew 'mas'
brew 'terminal-notifier'
brew 'trash'
brew 'watch'
brew 'wget', args: ['with-iri']
brew 'z'
brew 'zsh-completions'

# Install Mac App Store apps.
mas '1Password', id: 443987910
mas 'Acorn', id: 634108295
mas 'Dash', id: 449589707
mas 'GIF Brewery 3', id: 1081413713
mas 'iMovie', id: 408981434
mas 'iPhoto', id: 408981381
mas 'Keynote', id: 409183694
mas 'Mactracker', id: 430255202
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Reeder', id: 880001334
mas 'Slack', id: 803453959
mas 'Soulver', id: 413965349
mas 'Twitter', id: 409789998
mas 'The Unarchiver', id: 425424353

# Tap Cask.
tap 'caskroom/cask'
# Tap the Versions Caskroom.
tap 'caskroom/versions'

# Install Cask apps.
cask 'alfred'
cask 'carbon-copy-cloner'
cask 'colloquy'
cask 'daisydisk'
cask 'day-o'
cask 'divvy'
cask 'dropbox'
cask 'flux'
cask 'free-ruler'
cask 'github-desktop'
cask 'google-chrome'
cask 'iterm2'
cask 'kaleidoscope'
cask 'powerphotos'
cask 'provisioning'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'remote-buddy'
cask 'spotify'
cask 'sublime-text3'
cask 'transmission'
# Not the latest version.
cask 'typinator59'
cask 'webpquicklook'
cask 'wwdc'
